tap "adoptopenjdk/openjdk"
tap "dart-lang/dart"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "spicetify/tap"
brew "python@3.13"
brew "azure-cli"
brew "cairo"
brew "openjdk"
brew "bundletool"
brew "coreutils"
brew "cask"
brew "cbonsai"
brew "chezmoi"
brew "ruby"
brew "cocoapods"
brew "dart-sdk"
brew "fastfetch"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "pango"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-quick-stats"
brew "go"
brew "handbrake"
brew "icu4c@76"
brew "imessage-exporter"
brew "immich-go"
brew "jenv"
brew "jq"
brew "maven"
brew "micro"
brew "node"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "yt-dlp"
brew "mpv"
brew "nginx"
brew "ocrmypdf"
brew "openjdk@17", link: true
brew "pkgconf"
brew "poppler"
brew "python@3.12"
brew "qrencode"
brew "ripgrep"
brew "ruby@3.1"
brew "spicetify-cli"
brew "topgrade"
brew "watchman"
brew "dart-lang/dart/dart", link: false
cask "anki"
cask "audacity"
cask "bitwarden"
cask "brave-browser"
cask "claude"
cask "cursor"
cask "flutter"
cask "gcloud-cli"
cask "google-drive"
cask "granola"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "legcord"
cask "motrix"
cask "mtmr"
cask "musescore"
cask "ngrok"
cask "obsidian"
cask "openscad"
cask "prismlauncher"
cask "raycast"
cask "signal"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "telegram"
cask "todoist-app"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "yaak"
cask "zed"
cask "zen"
cask "zulu@8"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "draivin.hscopes"
vscode "draivin.hsnips"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "twxs.cmake"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
npm "@expo/cli"
npm "eas-cli"
npm "netlify-cli"
npm "ppllm"
